docs/posts/2023-02-01-list-spacing-in-org-mode-with-enumitem.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- Dec 04, 2024 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>List Spacing in Org Mode with Enumitem</title>
<meta name="author" content="Randy Ridenour" />
<meta name="generator" content="Org Mode" />
<link rel='icon' type='image/x-icon' href='/images/favicon.ico'/>
<meta name='viewport' content='width=device-width, initial-scale=1'>
<link rel='stylesheet' href='/css/neat.css' type='text/css'/>
<link rel='stylesheet' href='/css/custom.css' type='text/css'/>
<link rel='stylesheet' href='/css/syntax-coloring.css' type='text/css'/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="/"> UP </a>
 |
 <a accesskey="H" href="/"> HOME </a>
</div><header id="top" class="status">
<div class="banner">
  <h2><a href="/">Randy Ridenour</a></h2>
  <nav class="navbar">
    <ul>
      <li><a href="/posts/">Blog</a></li>
      <li><a href="/about.html">About</a></li>
      <li><a href="/index.xml">RSS</a></li>
    </ul>
  </nav>
</div>
</header>
<main id="content" class="content">
<header>
<h1 class="title">List Spacing in Org Mode with Enumitem</h1>
<p class="subtitle" role="doc-subtitle">Feb 01, 2023</p>
</header><p>
I like to use the LaTeX package enumitem to eliminate the spacing in lists. To do this globally, add the following to the Org mode headers:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+LaTeX_HEADER: \usepackage{enumitem}</span>
<span class="org-org-meta-line">#+LaTeX_HEADER: \setlist{nosep}</span>
</pre>
</div>

<p>
If you also don&rsquo;t want your lists to be indented, use 
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+LaTeX_HEADER: \setlist{nosep,wide}</span>
</pre>
</div>

<p>
These global options can be overridden for individual lists by putting something like this immediately before the list begins:
</p>

<div class="org-src-container">
<pre class="src src-org"><span class="org-org-meta-line">#+ATTR_LaTeX: :options [itemsep=1em]</span>
</pre>
</div>

<p>
This will put a space equal to the width of an upper-case &ldquo;M&rdquo; between each list item. 
</p>
</main>
<footer id="postamble" class="status">
<div class='footer'>
  Copyright © 2024 <a href='mailto:rlridenour@fastmail.com'>Randy Ridenour.</a><br>
  Last updated on Dec 04, 2024. Generated using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.4 (<a href="https://orgmode.org">Org</a> mode 9.8-pre).
</div>
</footer>
</body>
</html>
